Белгипрозем_2017/src/InformationRegisters/ОчередьУведомлений/ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьУведомлений</name>
  <resources>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстУведомления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.КатегорииДанных</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.СпособыУведомления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПодписки</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.КатегорииДанных</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>ВыполнениеЗадачПоПочте</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентноеИзменение</name>
  </enumValues>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>УведомленияПрограммы</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СобытияУведомлений/СобытияУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияУведомлений</name>
  <enumValues>
    <name>ПодошелСрокЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеМоейЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ПеренаправлениеМоейЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПодошелСрокДействияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПодошелСрокКонтрольнойТочки</name>
  </enumValues>
  <enumValues>
    <name>ЗакончилсяСрокДействияДокумента</name>
  </enumValues>
  <enumValues>
    <name>СозданиеУведомленияПрограммы</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаЗадачаАвтора</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаКонтрольнаяТочка</name>
  </enumValues>
  <enumValues>
    <name>ПросроченаОценкаКонтрольнойТочки</name>
  </enumValues>
  <enumValues>
    <name>ПодошелСрокКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СозданиеЗаписиКалендаря</name>
  </enumValues>
  <enumValues>
    <name>ПросроченКонтроль</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СпособыУведомления/СпособыУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУведомления</name>
  <enumValues>
    <name>НеЗадано</name>
  </enumValues>
  <enumValues>
    <name>ПоПочте</name>
  </enumValues>
  <enumValues>
    <name>ПоPush</name>
  </enumValues>
  <enumValues>
    <name>ПоSMS</name>
  </enumValues>
  <enumValues>
    <name>Окном</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/УведомленияПрограммы/УведомленияПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УведомленияПрограммы</name>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомленийПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/РаботаСУведомлениямиПрограммыСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Работа с уведомлениями программы сервер
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет уведомление.
//
// Параметры:
//   - ДатаУведомления - Дата
//   - ОписаниеУведомления - Строка
//   - ВидУведомления - ПеречислениеСсылка.ВидыУведомленийПрограммы
//   - ПолучательУведомления - СправочникСсылка.Пользователи
//   - ОбъектУведомления - ЛюбаяСсылка
//
// Пример:
//   Попытка
//      БизнесПроцесс.Стартовать();
//   Исключение
//      Описаниеошибки = НСтр("ru = 'При старте процесс произошла ошибка...'");
//      ТекущийПользователь = Пользователи.ТекущийПользователь();
//
//      РаботаСУведомлениямиПрограммыСервер.ДобавитьУведомление(
//          ТекущаяДата(),
//          Описаниеошибки,
//          Перечисления.ВидыУведомленийПрограммы.Ошибка,
//          ТекущийПользователь,
//          БизнесПроцесс.Ссылка);
//   КонецПопытки
//
Процедура ДобавитьУведомление(
	ДатаУведомления,
	ОписаниеУведомления,
	ВидУведомления,
	ПолучательУведомления,
	ОбъектУведомления = Неопределено) Экспорт
	
	// Проверка ключевых параметров.
	Если ТипЗнч(ДатаУведомления) <> Тип("Дата")
		ИЛИ НЕ ЗначениеЗаполнено(ДатаУведомления) Тогда
		ОписаниеОшибки = НСтр(
			"ru = 'Не указана дата уведомления.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеУведомления) <> Тип("Строка")
		ИЛИ НЕ ЗначениеЗаполнено(ОписаниеУведомления) Тогда
		ОписаниеОшибки = НСтр(
			"ru = 'Не указано описание уведомления.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Если ТипЗнч(ВидУведомления) <> Тип("ПеречислениеСсылка.ВидыУведомленийПрограммы")
		ИЛИ НЕ ЗначениеЗаполнено(ВидУведомления) Тогда
		ОписаниеОшибки = НСтр(
			"ru = 'Не указан вид уведомления.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Если ТипЗнч(ПолучательУведомления) <> Тип("СправочникСсылка.Пользователи")
		ИЛИ НЕ ЗначениеЗаполнено(ПолучательУведомления) Тогда
		ОписаниеОшибки = НСтр(
			"ru = 'Не указан получатель уведомления.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	// Создание нового уведомления.
	НовоеУведомление = Справочники.УведомленияПрограммы.СоздатьЭлемент();
	НовоеУведомление.Дата = ДатаУведомления;
	НовоеУведомление.Описание = ОписаниеУведомления;
	НовоеУведомление.ВидУведомления = ВидУведомления;
	НовоеУведомление.Пользователь = ПолучательУведомления;
	НовоеУведомление.Объект = ОбъектУведомления;
	НовоеУведомление.Записать();
	
	// Добавление в очереди уведомлений для рассылки уведомления программы по почте
	// через механизм подписок на события.
	ВключенаПодпискаНаУведомлениеПрограммы = РаботаСУведомлениями.ПолучитьНастройкуПользователя(
		ПолучательУведомления,
		Перечисления.НастройкиУведомлений.УведомленияПрограммы, 
		Перечисления.СобытияУведомлений.СозданиеУведомленияПрограммы);
	
	Если ВключенаПодпискаНаУведомлениеПрограммы Тогда
		РегистрыСведений.ОчередьУведомлений.ДобавитьУведомление(
			НовоеУведомление.Ссылка,
			ПолучательУведомления,
			Перечисления.СпособыУведомления.ПоПочте,
			ОписаниеУведомления,
			Перечисления.СобытияУведомлений.СозданиеУведомленияПрограммы,
			НовоеУведомление.Ссылка);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Проверяет наличие неотработанных уведомлений у текущего пользователя.
//
// Возвращаемое значение:
//   - Булево - Принимает значение Истина, если у пользователя имеются
//              уведомления, иначе - Ложь.
Функция ЕстьУведомленияДляТекущегоПользователя() Экспорт
	
	Если КоличествоУведомленийДляТекущегоПользователя() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Получает количество уведомлений для текущего пользователя
//
// Возвращаемое значение:
//   - Число
//
Функция КоличествоУведомленийДляТекущегоПользователя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УведомленияПрограммы.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.УведомленияПрограммы КАК УведомленияПрограммы
		|ГДЕ
		|	УведомленияПрограммы.Пользователь = &Пользователь
		|	И УведомленияПрограммы.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
